{"name":"Gyuri Kim","headerTaglineOne":"","headerTaglineTwo":"I'm Gyuri Kim.","headerTaglineThree":"Blockchain Devloper","headerTaglineFour":"","showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/bbb4756?tab=repositories"},{"id":"4","title":"Blog","link":"https://green-grapes.tistory.com/"},{"id":"5","title":"Email","link":"mailto:hey.rlarbfl4756@gmail.com"}],"projects":[{"id":"1","title":"NFT Music Streaming Platform (dApp)","description":"가장 최근에 진행한 이더리움 기반 뮤직 스트리밍 플랫폼 프로젝트입니다. 39일 간 작업하였습니다. 현재 음원 스트리밍 플랫폼 시장은 저작권자에게 절대적으로 불리한 시장입니다. 중계 수수료가 총 수익의 30%를 넘어가며, 수익 정산도 4개월에 한 번씩 진행됩니다. 만약, 스마트 컨트랙트를 통해 이 과정들을 전부 없앤다면 저작권자는 평소의 3배 이상의 수익을 낼 수 있으며, 버튼 하나만 눌러 메타마스크 서명을 통해, 수익을 즉시 출금할 수 있습니다. dApptunes는 유저들의 정기 구독권을 통한 수익만을 창출합니다. 음원 발행과 수익 출금 모두 사용자의 몫이기 때문입니다. 음원 발행 방식은 다음과 같습니다. 저작권자가 음원을 등록 버튼 누르면 음원 커버 사진과 음원이 각각 pinata ipfs, google cloud platform에 저장됩니다. metadata 주소가 생성되면, 메타마스크 서명 창이 뜨고, 승인 버튼을 누르면 스마트 컨트랙트가 발동되며 NFT 뮤직 토큰이 발행됩니다. 저작권자는 여기서 오는 스트리밍 수로 수익을 창출할 수 있으며, 출금 버튼 하나를 눌러 스마트컨트랙트를 발동시켜 수익 출금이 가능합니다. 거기에서 그치지 않고 이 토큰의 판매, 경매를 통해 음원에 대한 수익 권한을 사고 팔수도 있습니다. 기능 시연 동영상 주소 🔗 https://youtu.be/4L02E1wwLDA","imageSrc":"images/dapp.gif","url":"https://github.com/acentmeta/TEAM1-NFTunes-FE"},{"id":"2","title":"Block Explorer","description":"다섯 번째로 진행한 block explorer 개인 프로젝트입니다. 1주 간 작업하였습니다. 블록 체인 탐색기는 API와 블록 체인 노드를 사용하여 블록 체인에서 다양한 데이터를 가져온 다음 데이터베이스를 사용하여 검색된 데이터를 정렬하고 검색 가능한 형식으로 사용자에게 데이터를 제공합니다. 사용자는 블록 체인 탐색기를 사용해 최근에 채굴 된 블록 또는 블록 체인에서 최근에 수행 된 트랜잭션에 대한 데이터를 검색하고 탐색 할 수 있습니다. 기능 시연 동영상 주소 🔗 https://youtu.be/wi4uXnAweic","imageSrc":"images/explorer.gif","url":"https://github.com/bbb4756/block_explorer"},{"id":"3","title":"도넛 철도 999","description":"네번 째로 진행한 react 팀 프로젝트입니다. 3주 간 작업하였습니다. 수도권에 도넛 프렌차이즈 가게들이 우후죽순 생겨나고 있지만, 정작 수제 도넛 집은 60곳도 채 되지 않습니다. 이미 기존에 맛집 사이트가 넘쳐 나지만, 도넛이라는 특정 음식만의 리뷰와 랭킹을 매기는 사이트는 전무합니다. 저희는 수도권인데도 불구하고 수제 도넛 가게 집의 수는 생각보다 적으며 도넛 매니아 층은 그 수가 점점 증가하고 있다는 점에 집중하였습니다. 도넛 철도 999에선 흔하디 흔한 프렌차이즈 도넛을 제외한 수제 도넛 맛집만의 리뷰, 평점, 랭킹 등을 볼 수 있습니다. 또한, 수요 층의 연령대(10 ~ 20대)를 고려하여 맛집 사이트와 지하철 노선도를 접목 시켜 역 근처의 맛집을 지하철 노선도의 역의 드래그 앤 드롭 및 클릭을 통해 간편하게 알아낼 수 있습니다. 기능 시연 동영상 주소  🔗 https://youtu.be/HuNnpL-s1zk","imageSrc":"images/donut.gif","url":"https://github.com/bbb4756/donut999"},{"id":"4","title":"경일 아카데미 커뮤니티","description":"세번 째로 진행한 node 팀 프로젝트입니다. 3주간 작업하였습니다. 세번 째로 진행한 node 팀 프로젝트입니다. 3주간 작업하였습니다. 경일 커뮤니티는 경일 아카데미 학생들을 위한 사이트입니다. 경일 아카데미는 여러 가지 교육 과정, 몇 십 개의 기수가 존재하지만 학생들 간의 소통은 전무합니다. 학원 생 간의 코드 자문부터, 멘토-멘티 활동, 취업 정보 공유, 나아가 게임 듀오나 친목까지 학원 내에서의 원활한 소통이 이뤄지길 바라는 마음에서 제작하였습니다. 기능 시연 동영상 주소 🔗  https://www.youtube.com/watch?v=arvPL71g1rs","imageSrc":"images/kyungli.gif","url":"https://github.com/bbb4756/NodeProject"},{"id":"5","title":"Mini 게시판","description":"두번째로 진행한 미니 노드 팀 프로젝트입니다. nunjucks를 이용해 간단한 로그인, 회원가입, 유저 정보 수정 및 탈퇴, 게시판 (CRUD)  기능을 구현하였습니다. 기능 시연 동영상 주소 🔗  https://youtu.be/THq87rMiDM4","imageSrc":"images/node.gif","url":"https://github.com/bbb4756/yoongyuyeju"},{"id":"6","title":"쇼핑몰 Clone Project","description":"가장 처음 진행한 개인 미니 프로젝트입니다. 1주간 작업하였습니다.  Tocobo 사이트를 클론하여 만들었습니다.  html와 css를 전반적으로 이해할 수 있는 기회가 되었습니다. 기능 시연 동영상 주소 🔗 https://youtu.be/FnnaCTM6Weo","imageSrc":"images/clone.gif","url":"https://github.com/bbb4756/Tocobo"}],"services":[{"id":"1","title":"Art Direction","description":"We help with the creation and development of online advertising ideas, with particular focus on their visual appearance."},{"id":"2","title":"Branding","description":"We design key brand elements such as the logo, color scheme, typography, and other design components that makes your brand stand out from competitors."},{"id":"3","title":"Web Design","description":"We build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."},{"id":"4","title":"3D Design","description":"We combine creative design and technical skills to build striking 3D visualisations that bring your project to life."}],"aboutpara":"안녕하세요. 블록체인 주니어 개발자 김규리입니다. 대학생 때부터 취미로 프로그래밍 언어를 독학했지만 턱 없이 부족한 지식으로 감히 이 길로 뛰어들 엄두가 나지 않았습니다. 졸업 후, 이 길을 선택하지 않으면 평생 후회로 남을 것 같아 4년 간 배웠던 것을 포기하고, 소프트웨어 엔지니어라는 꿈을 선택했습니다. 그 순간의 간절함과 가슴 떨림은 개발 중 어려움에 직면했을 때마다 극복할 수 있는 큰 원동력이 됩니다. 제 인생의 변화 점이었던 그 때를 평생 잊지 않고 매 순간 감사함을 느끼며 노력하는 개발자가 되겠습니다.\n","resume":{"tagline":"👋  I'm a blockchain devloper.","description":"애자일 방법론 중 익스트림 프로그래밍을 통한 프로젝트 경험 有, git flow 방법론을 사용한 프로젝트 경험 有","experiences":[{"id":"1","dates":"2018. 10. ~ 2019. 08","type":"캐슬파인 골프 클럽","position":"사원","bullets":"프론트 체크인, 체크 아웃, 예약"}],"education":{"universityName":"블록체인 기반 핀테크 및 응용 SW 개발자 양성과정 5기","universityDate":"2021. 12. 20. ~ 2022. 10. 25","universityPara":"주식회사 경일 게임 아카데미"},"languages":["JavaScript(ES6)","TypeScript","HTML5","CSS3","Node.js","Solidity"],"frameworks":["React","Next.js","Express","Redux-saga","Redux-toolkit(RTK)","Web3","Truffle, Ganache"],"others":["Docker","Git, Git hub","AWS EC2","Linux, Ubuntu","MySQL, MongoDB"]}}